enum DatabaseTreeItem {

    /**
     * 实例
     */
    INSTANCE = 1,

    /**
     * 数据库
     */
    DATABASE = 2,

    /**
     * 类型
     */
    TYPE = 3,

    // ------------------------------------>

    /**
     * 表
     */
    TABLE = 4,

    /**
     * 视图
     */
    VIEW = 5,

    // <------------------------------------

    /**
     * 组
     */
    GROUP = 6,

    // ------------------------------------>

    /**
     * 字段
     */
    COLUMN = 7,

    /**
     * 键
     */
    KEY = 8,

    /**
     * 索引
     */
    INDEX = 9

    // <------------------------------------

}

export default DatabaseTreeItem;